Revit 2026 API

# ConduitSettingsConnectorSeparator Property

---

The conduit connector separator string.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ConnectorSeparator { get; set; }
```
```vb
Public Property ConnectorSeparator As String
	Get
	Set
```
```cpp
public:
property String^ ConnectorSeparator {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ConnectorSeparator : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ConduitSettings Class

Autodesk.Revit.DB.Electrical Namespace